Merge pull request #16 from paritytech/snapshot/20260613
chore: sync daily snapshot
